
#Область ПрограммныйИнтерфейс

Функция ВыполнитьЗапросWS(ТекстЗапроса, Параметры, ТипОбходаЗапроса) Экспорт
        
    Запрос 			= Новый Запрос;
    Запрос.Текст 	= ТекстЗапроса;   
	ТабПараметры 	= ЗначениеИзСтрокиВнутр(Параметры);
	
    Для Каждого Стр из ТабПараметры Цикл
        Запрос.УстановитьПараметр(Стр.Ключ, Стр.Значение);
    КонецЦикла;
	
	ТипОбхода 			= ОбходРезультатаЗапроса[ТипОбходаЗапроса];
    РезультатЗапроса 	= Запрос.Выполнить();
	ТабЗначений			= РезультатЗапроса.Выгрузить(ТипОбхода);
	
	результат = ЗначениеВСтрокуВнутр(ТабЗначений);
   
    Возврат Результат;
     
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Сериализаци

Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
	
	ЧтениеXMLДанных = Новый ЧтениеXML;
    ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
    ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
    ЧтениеXMLДанных.Закрыть();  
	
	Возврат ТЗ;
	
КонецФункции

Функция Сериализовать(ОбъектСериализации)
	
	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
    МойXML = Новый ЗаписьXML;
    МойXML.УстановитьСтроку();
    ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
	
	Возврат МойXML.Закрыть();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область КОММЕНТАРИЙ_КАК_ИСПОЛЬЗОВАТЬ

// 1. Публикация вебсервиса "KernelReceiver"
// 2. В какой либо базе реализовать метод "ПослатьЗапрос"

// Функция - Послать запрос
//
// Параметры:
//  ТекстЗапроса	 - Строка - Описывает запрос к данным.
//  Параметры		 - Структура - Параметры для запроса.
//  ТипОбходаЗапроса - Строка - "ПоГруппировкам", ПоГруппировкамСИерархией", "Прямой"
//	(это тип "ОбходРезультатаЗапроса" так как на стороне ws сервера будет выполнена Выгрузка запроса)
// 
// Возвращаемое значение:
//  Ответ - ЗначениеИзСтрокиВнутр - Произвольный
//
Функция ПослатьЗапросЗУП(ТекстЗапроса, Параметры = "", ТипОбходаЗапроса = "Прямой") Экспорт

	ИмяСервера 			= "http://192.168.88.203:8012/"; 
	ИмяБазы 			= "zup";
	ИмяWS 				= "KernelReceiver";
    ПространствоИмен 	= "http://www.KernelReceiver_zup.com";

	WSОпределение 		= Новый WSОпределения(ИмяСервера + ИмяБазы + "/ws/" + ИмяWS + ".1cws/?wsdl");
	Прокси 				= Новый WSПрокси(WSОпределение, ПространствоИмен , ИмяWS, ИмяWS + "Soap");
	    
    стрПараметры 		= ЗначениеВСтрокуВнутр(Параметры);
    ОтветWS 			= Прокси.ВыполнитьЗапрос(ТекстЗапроса, стрПараметры, ТипОбходаЗапроса);

    Ответ = ЗначениеИзСтрокиВнутр(ОтветWS);   
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти